waveFlume/case4-irregular/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    atmosphere
    {
        type            patch;
        nFaces          1250;
        startFace       253648;
    }
    outlet
    {
        type            patch;
        nFaces          102;
        startFace       254898;
    }
    inlet
    {
        type            patch;
        nFaces          102;
        startFace       255000;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1250;
        startFace       255102;
    }
    leftSide
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          127500;
        startFace       256352;
    }
    rightSide
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          127500;
        startFace       383852;
    }
)

// ************************************************************************* //
